run/testBasic/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    YZ-Xmin
    {
        type            freestreamPressure;
        freestreamValue $internalField;
    }

    YZ-Xmax
    {
        type            freestreamPressure;
        freestreamValue $internalField;
    }

    XZ-Ymin
    {
        type            zeroGradient;
    }

    XZ-Ymax
    {
        type            zeroGradient;
    }

    XY-Zmin
    {
        type            zeroGradient;
    }

    XY-Zmax
    {
        type            zeroGradient;
    }

    aggregate
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
